[
    
        {
            "title":"Roasted Eggplant Pastitsio",
            "author":"FrancesC - AllRecipes employee",
            "description": "Cook's Notes: To make this recipe ahead of time, you can assemble the casserole and refrigerate, covered with plastic wrap, or freeze. To reheat from the refrigerator, cover baking dish with aluminum foil and bake for about 1 hour, removing the foil for the last 20 minutes. If you bake it directly from the freezer, bake for 1 hour covered, and about 30 minutes uncovered.",
            "ingredients":["1 large eggplant", "1 tbsp olive oil", "1 pound ground lamb", "1 clove garlic, minced", "1 1/2 cups of chopped onion", "1 1/2 teaspoons salt", "1 teaspoon ground cumin", "1 teaspoon dried oregano", "1/4 teaspoon black pepper", "1/4 teaspoon ground cinammon", "1 can (14 ounce) crushed tomatoes", "1 tablespoon fresh mint, chopped", "2 eggs", "2 tablespoons unsalted butter", "2 tablespoons all-purpose flour", "2 cups milk", "1 clove garlic, lightly crushed", "1 package (8 ounce) crumbled feta cheese", "1/2 teaspoon salt", "Black pepper to taste", "1 pinch freshly greated nutmeg", "1 package (12 ounce) penne pasta", "Cooking spray"],
            "substitutes":{
                "1":["Canola oil", "Vegetable oil"],
                "2":["Ground beef", "1/2 pound beef, 1/2 pound lamb"],
                "21":["Ziti", "Rigatoni", "Any other tubular pasta of your choice"]
            },
            "skills":["Chopping vegetables","Mincing garlic","Boiling water", "Chopping herbs", "Oven broiling"],
            "equipment":["Knife", "Chopping board", "Oven", "Stove top, pot and strainer", "Skillet", "Whisk", "Heatproof bowl", "Baking dish"],
            "stepAmount":10,
            "bodies":["Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil; place eggplant halves on top.", "Broil eggplant, checking fairly often and rotating the baking sheet as needed, until the skin blackens and starts to char in places, about 15 minutes. Cool until easily handled, about 5 minutes. Peel off skin and coarsely chop flesh.", "Heat olive oil in a large skillet over medium heat. Add onions; cook and stir over medium heat until onion is translucent, about 5 minutes. Add lamb and cook, breaking it up into small pieces, until no pink remains, about 5 minutes. Drain grease from the skillet.", "Stir minced garlic, salt, cumin, oregano, pepper, and cinnamon into the skillet; cook for 1 minute. Stir in chopped eggplant, diced tomatoes, and crushed tomatoes. Bring sauce to a simmer and cook until thickened, about 20 minutes. Remove from heat and stir in chopped mint.", "Melt butter in a saucepan over medium heat. Stir in flour and cook, stirring constantly, for 2 minutes. Pour in milk and whisk until smooth. Add crushed garlic clove, increase heat to high, and bring milk to a boil. Reduce heat and simmer, stirring frequently, until slightly thickened, about 5 minutes more. Remove from heat; discard garlic clove", "Whisk eggs in a large heatproof bowl. Pour hot milk mixture in a steady stream into beaten eggs, whisking constantly. Stir in feta cheese, salt, pepper, and nutmeg.", "Preheat oven to 425 degrees F (220 degrees C). Spray a 9x13-inch baking dish with cooking spray.", "Bring a large pot of salted water to boil. Add pasta and cook, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.", "Divide pasta between the white sauce and the lamb sauce and mix to combine. Pour the pasta with lamb sauce into the prepared baking dish; spread the pasta with white sauce on top.", "Bake in the preheated oven until top is golden and pastitsio is bubbling, about 30 minutes. Let cool for 5 minutes before serving."]
        },
        {
            "title":"AnotherRecipeTitle",
            "author":"AnotherRecipeAuthor",
            "ingredients":["ingredient1", "ingredient2", "ingredient3"],
            "skills":["skill1","skill2","skill3"],
            "equipment":["equipment1", "equipment2", "equipment3"],
            "stepAmount":5,
            "bodies":["This is the first part", "This is the second part", "This is the third part", "This is the fourth part", "This is the fifth part"]
        },
        {
            "title":"AnotherRecipeTitle",
            "author":"AnotherRecipeAuthor",
            "ingredients":["ingredient1", "ingredient2", "ingredient3"],
            "skills":["skill1","skill2","skill3"],
            "equipment":["equipment1", "equipment2", "equipment3"],
            "stepAmount":5,
            "bodies":["This is the first part", "This is the second part", "This is the third part", "This is the fourth part", "This is the fifth part"],
            "substitutes":{
                "1":["A", "B", "C"],
                "2":["D", "F"]
            }
        }
]